for i in range(100, 201, 1):    # перебираємо числа із задоного проміжку
    k = 0
    for j in range(1, i+1):     # перебираємо числа із проміжку дільників
        if i % j == 0:  # перевіряємо число з i на остачу від ділення на j
            k += 1      # в разі вірності збільшуємо показник на 1
    if k == 2:          # перевіряємо k після виконання циклу
        a = i
        total = 0
        while a > 0:        # цикл знаходження total
            total = total + (a % 10)
            a = a // 10
            if total > 9:   # перевірка чи чило є двоцифровим
                total = total // 10 + total % 10
        print(i, '=', total)
