a = float(input("Введіть першу змінну "))
b = float(input("Введіть другу змінну "))
c = float(input("Введіть третю змінну "))
if (a + b) % 2 == 0: # перевірка на парність суми 1-го та 2-го
    print("Існує пара числ сума яких є парною")
elif (a + c) % 2 == 0: # перевірка на парність суми 1-го та 3-го
    print("Існує пара числ сума яких є парною")
elif (b + c) % 2 == 0: # перевірка на парність суми 2-го та 3-го
    print("Існує пара числ сума яких є парною")
else :
    print("Не існує такої пари ")

